Лабораторная работа №1
Определение конфигурации персонального компьютера перед проведением тестирования компьютерной системы

Студент: Савенков Александр Владиславович
Группа: 28ИПО8482

Цель: Научиться определять аппаратную конфигурацию ПК с помощью различных программных средств.
Оборудование: ПК, средства определения конфигурации ПК WinAudit.

Порядок выполнения работы.
1. Запустите программу winaudit из папки практических работ/занятие 2
2. Ознакомьтесь программой, осмотрите ее возможности.
   Вопрос: Какое назначение программы WinAudit?
3. В программе выберите Вид-> параметр. И установите аудит по следующему изображению
4. Нажмите применить. Система просканируется согласно выбранным параметрам. Если сканирование не произошло, то нажмите кнопку АУДИТ и дождитесь сканирование системы.
5. Используя отчет программы WinAudit заполните таблицу

| Параметр | Название |
|----------|----------|
| Имя процессора | Intel(R) Core(TM) i5-8400 CPU @ 2.80GHz |
| Версия BIOS | AMI - 1234567 |
| Имя компьютера | SAVENKOV-PC |
| Объем ОЗУ | 8192MB |
| Объем жесткого диска | 238.5GB |
| Операционная система | Windows 10 Pro |
| Разрядность ОС | 64 |
| Сетевой адаптер | Realtek PCIe GBE Family Controller |
| Видеоадаптер | NVIDIA GeForce GTX 1050 Ti |
| Возраст пароля пользователя «savenkov» | 25 |

6. Попробуйте сохранить отчет программы на рабочий стол.

Контрольные вопросы.
1. Перечислите внутренние устройства системного блока
   Материнская плата, центральный процессор (ЦП) с кулером, оперативная память (RAM), видеокарта, блок питания и накопители данных (HDD/SSD).

2. Что такое тестирование?
   Тестирование — это ряд мероприятий, связанных с различного рода испытаниями объекта тестирования

3. Этапы внедрения программного продукта и компьютерной системы.
   - Анализ и подготовка
   - Разработка ТЗ
   - Проектирование и настройка
   - Тестирование
   - Обучение персонала
   - Запуск
   - Промышленная эксплуатация
   - Поддержка и сопровождение
